{
    "lastUpdated": "2025-09-30T14:00:00Z",
    "indices": [{
            "category": "Business Indicators",
            "agency": "Federal Reserve",
            "name": "Industrial Production Index",
            "releaseDay": 15,
            "url": "https://www.federalreserve.gov/releases/g17/current/",
            "march": "103.5",
            "april": "103.6",
            "may": "103.7",
            "june": "104.2",
            "july": "103.8",
            "august": "103.9",
            "change": "",
            "explanation": "The Industrial Production Index (IPI) measures the real output of manufacturing, mining, electric and gas utilities, and other industrial sectors. Published by the Federal Reserve, it's a key indicator of economic activity and industrial capacity utilization. The index is seasonally adjusted and expressed as a percentage of real output relative to a base year (currently 2017=100). Changes in the index reflect both cyclical and structural shifts in the economy. The manufacturing component is particularly watched as a leading indicator of economic health. The report also includes capacity utilization rates, which measure how much of the nation's industrial capacity is being used."
        },
        {
            "category": "Business Indicators",
            "agency": "NFIB",
            "name": "Small Business Optimism Index",
            "releaseDay": 12,
            "url": "https://www.nfib.com/news/monthly_report/sbet/",
            "march": "97.1",
            "april": "98.6",
            "may": "98.6",
            "june": "98.6",
            "july": "100.3",
            "change": "+1.7",
            "explanation": "The NFIB Small Business Optimism Index is based on a monthly survey of small business owners across the U.S. The index is a composite of 10 components including plans to increase employment, inventory, and capital spending, and expectations for the economy. Readings above 100 indicate expansion, while below 100 suggests contraction. The index is closely watched as small businesses account for about 44% of U.S. economic activity and are often the first to experience and respond to economic changes. The report also includes data on hiring plans, capital spending intentions, and concerns about inflation or labor quality."
        },
        {
            "category": "Business Indicators",
            "agency": "The Conference Board",
            "name": "Leading Economic Indicator",
            "releaseDay": 22,
            "url": "https://www.conference-board.org/topics/leading-economic-indicators",
            "march": "",
            "april": "99.1",
            "may": "99.1",
            "june": "98.8",
            "july": "98.7",
            "change": "",
            "explanation": "The Conference Board's Leading Economic Index (LEI) is a composite of 10 forward-looking economic indicators that typically change direction before the overall economy does. The components include average weekly hours in manufacturing, stock prices, building permits, and consumer expectations. The index is designed to signal peaks and troughs in the business cycle, with three consecutive monthly declines often preceding a recession. The LEI is expressed as an index with 2016 as the base year (2016=100). Economists and policymakers use the LEI to anticipate turning points in the economy, with a six- to nine-month lead time. The index is published monthly and is subject to revisions as more complete data becomes available. The Conference Board also produces Coincident and Lagging Economic Indexes to provide a comprehensive view of the business cycle."
        },
        {
            "category": "Consumer Indicators",
            "agency": "BLS",
            "name": "CPI",
            "releaseDay": 11,
            "url": "https://www.bls.gov/cpi/data.htm",
            "march": "319.8",
            "april": "320.8",
            "may": "321.465",
            "june": "322.561",
            "july": "323.048",
            "august": "323.976",
            "change": "",
            "explanation": "The Consumer Price Index (CPI) measures the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services. It's the most widely used measure of inflation, tracking price changes for a fixed basket of about 80,000 goods and services. The 'headline' CPI includes food and energy prices, which can be volatile month-to-month. The 'core' CPI excludes these volatile categories to show underlying inflation trends. The Federal Reserve targets 2% annual inflation as measured by the PCE price index, but CPI is more widely reported in the media and used for cost-of-living adjustments."
        },
        {
            "category": "Consumer Indicators",
            "agency": "BLS",
            "name": "PPI",
            "releaseDay": 14,
            "url": "https://www.bls.gov/ppi/data.htm",
            "march": "148.061",
            "april": "147.686",
            "may": "148.227",
            "june": "148.303",
            "july": "149.341",
            "august": "149.160",
            "change": "",
            "explanation": "The Producer Price Index (PPI) measures the average change over time in the selling prices received by domestic producers for their output. It tracks price changes from the perspective of the seller rather than the consumer. The PPI includes prices for goods, services, and construction sold to final demand and intermediate demand. It's considered a leading indicator of consumer price inflation, as producers often pass on higher costs to consumers. The PPI covers about 75% of U.S. goods-producing sectors and is used by businesses for contract adjustments and by economists to analyze economic trends."
        },
        {
            "category": "Employment Indicators",
            "agency": "FRED",
            "name": "Total Nonfarm Employment",
            "releaseDay": 5,
            "url": "https://fred.stlouisfed.org/series/PAYEMS",
            "february": "159,155,000",
            "march": "159,275,000",
            "april": "159,433,000",
            "may": "159,452,000",
            "june": "159,439,000",
            "july": "159,518,000",
            "august": "159,540,000",
            "change": "",
            "explanation": "The monthly change in nonfarm payroll employment, representing the net number of jobs added to the U.S. economy. This key employment metric from the Bureau of Labor Statistics (BLS) includes all nonfarm business, government, and nonprofit employees. The figure is seasonally adjusted to account for predictable employment patterns. A consistent monthly addition of 100,000-150,000 jobs is typically needed to keep pace with population growth. The report also includes revisions to previous months' data and is considered a lagging indicator, reflecting labor market conditions from the reference period (usually the pay period including the 12th of the month)."
        },
        {
            "category": "Employment Indicators",
            "agency": "FRED",
            "name": "Jobless Claims",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/ICSA",
            "march": "223,200",
            "april": "226,000",
            "may": "234,000",
            "june": "241,250",
            "july": "221,250",
            "august": "230,000",
            "change": "",
            "explanation": "The number of individuals who filed for unemployment insurance for the first time during the reference week. This weekly indicator, published by the Department of Labor, serves as a real-time measure of layoffs and labor market health. The four-week moving average smooths volatility and provides a clearer trend. Initial claims below 300,000 typically indicate a healthy job market, while sustained increases may signal economic weakening. The data is seasonally adjusted and includes all 50 states plus the District of Columbia, Puerto Rico, and the Virgin Islands. Economists watch this indicator closely as it provides one of the most current snapshots of labor market conditions."
        },
        {
            "category": "Employment Indicators",
            "agency": "BLS",
            "name": "Job Openings",
            "releaseDay": 0,
            "url": "https://www.bls.gov/jlt/data.htm",
            "march": "7,200,000",
            "april": "7,395,000",
            "may": "7,712,000",
            "june": "7,357,000",
            "july": "7,208,000",
            "august": "7,227,000",
            "change": "",
            "explanation": "The total number of job openings on the last business day of the month, as measured by the Job Openings and Labor Turnover Survey (JOLTS) from the BLS. This figure represents all positions that are open (not filled) on the last business day of the month. The job openings rate is calculated by dividing the number of job openings by the sum of employment and job openings, then multiplying by 100. This metric helps gauge labor market tightness, with higher numbers indicating more job opportunities relative to the number of unemployed workers. The ratio of unemployed persons per job opening is a key measure of labor market efficiency."
        },
        {
            "category": "Employment Indicators",
            "agency": "ADP",
            "name": "Private Employment",
            "releaseDay": 0,
            "url": "https://www.adpresearch.com",
            "march": "134,391,000",
            "april": "134,451,000",
            "may": "134,480,000",
            "june": "134,457,000",
            "july": "134,563,000",
            "august": "134,617,000",
            "change": "",
            "explanation": "The monthly change in private sector employment, excluding government jobs, as reported by the ADP National Employment Report. This survey of approximately 400,000 U.S. businesses provides an early indicator of labor market conditions, typically released two days before the BLS employment report. The data is seasonally adjusted and broken down by business size (small: 1-49 employees, medium: 50-499 employees, large: 500+ employees) and industry. While the ADP report can be volatile month-to-month, it provides valuable insights into private sector hiring trends and often influences market expectations for the official employment report. The data is based on actual payroll data from ADP clients."
        },
        {
            "category": "Employment Indicators",
            "agency": "The Conference Board",
            "name": "Employment Trends Index",
            "releaseDay": 0,
            "url": "https://www.conference-board.org/topics/employment-trends-index",
            "march": "",
            "april": "",
            "may": "",
            "june": "108.19",
            "july": "107.55",
            "change": "-0.59",
            "explanation": "The Employment Trends Index (ETI) is a composite labor market indicator that combines eight labor market indicators into a single measure. Developed by The Conference Board, it helps forecast employment trends and turning points in the labor market. The index components include job openings, industrial production, and business confidence surveys. A rising ETI suggests job growth will improve in the coming months, while a declining index may signal weakening employment conditions. The index is published monthly with a one-month lag and is particularly useful for identifying turning points in the labor market before they appear in the unemployment rate or payroll employment data."
        },
        {
            "category": "Housing Market",
            "agency": "Census",
            "name": "Housing Starts",
            "releaseDay": 18,
            "url": "https://www.census.gov/construction/nrc/current/index.html",
            "march": "1.355M",
            "april": "1.398M",
            "may": "1.282M",
            "june": "1.382M",
            "july": "1.429M",
            "august": "1.307M",
            "change": "",
            "explanation": "The number of new residential construction projects that began during the month, as reported by the U.S. Census Bureau. This leading indicator of housing market activity includes single-family homes, townhomes, and multi-family buildings with five or more units. The data is seasonally adjusted and annualized to project yearly totals. Housing starts are sensitive to interest rates, with higher rates typically depressing new construction. The report also includes building permits (a forward-looking indicator) and housing completions. Economists monitor the ratio of single-family to multi-family starts for insights into housing market trends and demographic shifts."
        },
        {
            "category": "Housing Market",
            "agency": "Census",
            "name": "New Home Sales",
            "releaseDay": 23,
            "url": "https://www.census.gov/construction/nrs/current/index.html#:~:text=New%20Home%20Sales,April%202024%20rate%20of%20719%2C000.",
            "march": "660,000",
            "april": "705,000",
            "may": "623,000",
            "june": "656,000",
            "july": "652,000",
            "change": "",
            "explanation": "The seasonally adjusted annual rate of newly constructed single-family homes sold during the month, as reported by the U.S. Census Bureau. This indicator measures demand for new residential construction and is considered a leading economic indicator. The data includes both completed homes and those under construction, with sales recorded when contracts are signed, not at closing. The median and average sales prices are also reported. New home sales account for about 10-15% of total home sales but are more sensitive to economic conditions than existing home sales, making them an important gauge of consumer confidence and economic health."
        },
        {
            "category": "Housing Market",
            "agency": "FRED",
            "name": "Affordability Index",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/FIXHAI",
            "march": "103.4",
            "april": "101",
            "may": "97",
            "june": "95",
            "july": "98.8",
            "change": "",
            "explanation": "A composite measure of housing affordability that considers home prices, mortgage interest rates, and median family income. The National Association of Realtors (NAR) Housing Affordability Index is set to 100, representing the point at which a median-income family has exactly enough income to qualify for a mortgage on a median-priced home. Values above 100 indicate greater affordability (a family with the median income has more than enough income to qualify), while values below 100 indicate declining affordability. The index assumes a 20% down payment and a 30-year fixed-rate mortgage. Regional variations can be significant due to differences in home prices and local incomes."
        },
        {
            "category": "Housing Market",
            "agency": "NAHB",
            "name": "Housing Market Index",
            "releaseDay": 18,
            "url": "https://www.nahb.org/news-and-economics/housing-economics/indices/housing-market-index",
            "march": "39",
            "april": "40",
            "may": "34",
            "june": "32",
            "july": "33",
            "august": "32",
            "september": "32",
            "change": "",
            "explanation": "The NAHB/Wells Fargo Housing Market Index measures homebuilder confidence in the market for newly built single-family homes. Based on a monthly survey of NAHB members, the index ranges from 0-100, with scores above 50 indicating more builders view conditions as good than poor. The survey includes three components: current sales conditions, sales expectations for the next six months, and traffic of prospective buyers. The HMI is a leading indicator of housing market health, often predicting changes in housing starts and new home sales. The index is seasonally adjusted and has historically correlated well with future housing market activity."
        },
        {
            "category": "Housing Market",
            "agency": "NAR",
            "name": "Median Home Price",
            "releaseDay": 0,
            "url": "https://www.nar.realtor/research-and-statistics/housing-statistics/existing-home-sales",
            "march": "$403,700",
            "april": "$414,000",
            "may": "$432,700",
            "june": "$435,300",
            "july": "$422,400",
            "august": "$422,600",
            "change": "",
            "explanation": "The median sales price of existing single-family homes sold during the month, as reported by the National Association of Realtors (NAR). This figure represents the midpoint of all home prices, with half of homes selling for more and half for less. The median price is influenced by the mix of homes sold in a given month and can be affected by seasonal patterns and regional variations. Unlike average prices, the median is less affected by extremely high or low sales. The data is not seasonally adjusted and can be volatile month-to-month. Year-over-year comparisons are often more meaningful indicators of price trends than month-to-month changes."
        },
        {
            "category": "Housing Market",
            "agency": "NAR",
            "name": "Pending Home Sales Index",
            "releaseDay": 28,
            "url": "https://www.nar.realtor/research-and-statistics/housing-statistics/pending-home-sales",
            "march": "76.1",
            "april": "71.3",
            "may": "72.6",
            "june": "72",
            "july": "71.8",
            "august": "74.7",
            "change": "",
            "explanation": "The Pending Home Sales Index (PHS), a leading indicator of housing activity, measures housing contract activity, and is based on signed real estate contracts for existing single-family homes, condos, and co-ops. Because a home goes under contract a month or two before it is sold, the Pending Home Sales Index generally leads Existing-Home Sales by a month or two."
        },
        {
            "category": "Housing Market",
            "agency": "FRED",
            "name": "30-yr Mortgage Rate",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/MORTGAGE30US",
            "march": "6.65",
            "april": "6.73",
            "may": "6.82",
            "june": "6.85",
            "july": "6.72",
            "august": "6.59",
            "september": "6.28",
            "change": "",
            "explanation": "The average interest rate on a 30-year fixed-rate mortgage, a key benchmark for U.S. home loans. This rate is based on a weekly survey of about 125 lenders by Freddie Mac and represents the interest rate a borrower would pay on a 30-year fixed mortgage with an 80% loan-to-value ratio. Mortgage rates are influenced by the 10-year Treasury yield, Federal Reserve monetary policy, inflation expectations, and overall economic conditions. Lower rates improve housing affordability and can stimulate home buying and refinancing activity, while higher rates can cool housing demand. The 30-year fixed mortgage is the most popular home loan product in the U.S., making this rate a critical indicator for the housing market and broader economy."
        },

        {
            "category": "Business Indicators",
            "agency": "FRED",
            "name": "10-yr Treasury Yield",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/DGS10",
            "march": "4.28",
            "april": "4.28",
            "may": "4.42",
            "june": "4.38",
            "july": "4.39",
            "august": "4.27",
            "september": "4.11",
            "change": "",
            "explanation": "The yield on the 10-year U.S. Treasury note, a benchmark for interest rates across the economy. This yield represents the return an investor would receive by holding the note to maturity. The 10-year Treasury yield is influenced by Federal Reserve policy, inflation expectations, economic growth prospects, and global demand for safe assets. It serves as a reference rate for many financial products, including mortgages, corporate bonds, and auto loans. When the 10-year yield rises, borrowing costs typically increase throughout the economy. The yield curve, which plots yields across different maturities, is closely watched for signals about economic growth and potential recessions (an inverted yield curve has preceded recent recessions)."
        },
        {
            "category": "Business Indicators",
            "agency": "S&P Global",
            "name": "Composite PMI (Flash)",
            "releaseDay": 22,
            "url": "https://www.pmi.spglobal.com/Public",
            "march": "",
            "april": "",
            "may": "",
            "june": "52.7",
            "july": "54.6",
            "change": "",
            "explanation": "The S&P Global Composite PMI (Purchasing Managers' Index) is a weighted average of the Manufacturing Output Index and the Services Business Activity Index, providing a comprehensive snapshot of private sector business activity. A reading above 50 indicates expansion, while below 50 signals contraction. This flash estimate is released about a week before the final data and is based on approximately 85% of total survey responses. The composite PMI is closely watched by economists and investors as an early indicator of economic health, as it reflects both manufacturing and services activity, which together account for the majority of economic output. The report includes sub-indices for new orders, employment, and business expectations."
        },
        {
            "category": "Business Indicators",
            "agency": "ISM",
            "name": "Manufacturing PMI",
            "releaseDay": 1,
            "url": "https://tradingeconomics.com/united-states/business-confidence",
            "march": "49",
            "april": "48.7",
            "may": "48.5",
            "june": "49",
            "july": "48",
            "august": "48.7",
            "change": "",
            "explanation": "The ISM Manufacturing PMI (Purchasing Managers' Index) is a monthly economic indicator based on a survey of purchasing managers at more than 300 manufacturing firms. A reading above 50 indicates expansion in the manufacturing sector, while below 50 indicates contraction. The index is calculated from five major survey components: new orders, inventory levels, production, supplier deliveries, and employment. The manufacturing sector is often seen as a leading indicator of overall economic health, as it responds quickly to changes in demand and business conditions. The report also includes price pressure indicators and order backlogs, providing insights into supply chain conditions and future production activity."
        },
        {
            "category": "Business Indicators",
            "agency": "The Conference Board",
            "name": "Lagging Economic Index",
            "releaseDay": 22,
            "url": "https://www.conference-board.org/topics/us-leading-indicators",
            "march": "118.9",
            "april": "119.3",
            "may": "119.6",
            "june": "119.9",
            "july": "119.9",
            "change": "",
            "explanation": "The Conference Board's Lagging Economic Index (LAG) is a composite of seven economic indicators that change after the economy as a whole changes. Components include the average duration of unemployment, the prime rate, and the ratio of consumer credit to personal income. The LAG helps confirm and assess the direction of the economy's movements over recent months. It's particularly useful for confirming that a turning point in the economy has actually occurred. The index is expressed relative to 2016=100 and is typically used in conjunction with the Leading and Coincident Economic Indexes to provide a comprehensive view of the business cycle."
        },
        {
            "category": "Business Indicators",
            "agency": "Commerce",
            "name": "New Orders",
            "releaseDay": 3,
            "url": "https://www.census.gov/economic-indicators/",
            "march": "$617.4B",
            "april": "$593.5B",
            "may": "$642.5B",
            "june": "$611.7B",
            "july": "$603.6B",
            "change": "",
            "explanation": "The New Orders indicator measures the value of new orders placed with domestic manufacturers for both durable and non-durable goods. It's a leading indicator of manufacturing activity and future production. The data, published by the U.S. Census Bureau, is adjusted for seasonal variation and trading day differences. A rising trend in new orders typically signals increased production and employment in the manufacturing sector, while declining orders may indicate an economic slowdown. The report breaks down orders by industry and includes data on unfilled orders and inventories, providing insights into supply chain conditions and future manufacturing activity."
        },
        {
            "category": "Business Indicators",
            "agency": "Commerce",
            "name": "Construction Spending",
            "releaseDay": 2,
            "url": "https://www.census.gov/construction/c30/current/index.html",
            "march": "$2,162B",
            "april": "$2,145B",
            "may": "$2,143.9B",
            "june": "$2,140.5B",
            "july": "$2,139.1B",
            "change": "",
            "explanation": "The total dollar value of construction work done in the U.S. each month, as reported by the U.S. Census Bureau. This includes both public and private construction projects, covering residential, non-residential, and infrastructure spending. The data is seasonally adjusted and annualized to show what the yearly total would be if that month's pace continued for 12 months. Construction spending is a coincident indicator of economic activity, reflecting current business investment and government expenditure. The report breaks down spending by sector (residential, commercial, manufacturing, etc.) and by funding source (private vs. public). Analysts watch for trends in construction spending as they can signal shifts in economic growth and employment in the construction sector."
        },
        {
            "category": "Business Indicators",
            "agency": "Census",
            "name": "Monthly Retail Sales",
            "releaseDay": 15,
            "url": "https://www.census.gov/retail/sales.html",
            "march": "",
            "april": "$722B",
            "explanation": "The total value of sales at retail establishments, adjusted for seasonal variation, holiday differences, and trading days. Published by the U.S. Census Bureau, this 'advance' report is based on a sample of about 5,500 retail and food services firms. The data is divided into 13 major categories, including motor vehicles, electronics, clothing, and e-commerce. Retail sales account for about one-third of consumer spending, which drives about 70% of U.S. economic activity. The 'core' retail sales figure (excluding autos, gas, and building materials) is closely watched as a measure of underlying consumer demand. The data is volatile month-to-month, so economists often look at the three-month moving average for trends.",
            "may": "$715.5B",
            "june": "$723B",
            "july": "$727.4B",
            "august": "$732B",
            "change": ""
        },
        {
            "category": "Consumer Indicators",
            "agency": "UMich",
            "name": "Consumer Sentiment",
            "releaseDay": 15,
            "url": "https://www.sca.isr.umich.edu",
            "march": "57.0",
            "april": "52.2",
            "may": "52.2",
            "june": "60.7",
            "july": "61.7",
            "august": "58.2",
            "september": "55.1",
            "change": "",
            "explanation": "Monthly survey by the University of Michigan (500+ phone interviews) assessing consumer attitudes about personal finances, business conditions, and buying conditions. The index is benchmarked to 100 (1966=100). Values above 90 suggest economic expansion, while values below 80 may indicate economic stress. The survey includes current conditions (40% weight) and expectations (60% weight) components. The expectations component is particularly important as it can predict future consumer spending patterns. The index is a leading indicator of consumer spending, which accounts for about 70% of U.S. economic activity."
        },
        {
            "category": "Consumer Indicators",
            "agency": "The Conference Board",
            "name": "Consumer Confidence",
            "releaseDay": 28,
            "url": "https://www.conference-board.org/topics/consumer-confidence",
            "march": "85.7",
            "april": "85.7",
            "may": "98.4",
            "june": "95.2",
            "july": "98.7",
            "august": "97.8",
            "september": "94.2",
            "change": "",
            "explanation": "Monthly survey by The Conference Board (3,000+ households) measuring consumers' assessment of current business/labor conditions and their expectations for the next six months. The index is benchmarked to 100 (1985=100). Values above 100 indicate positive sentiment. The expectations component is part of the Leading Economic Index and is closely watched for recession signals when it falls below 80. The Present Situation Index (current conditions) and Expectations Index (future conditions) provide insights into consumer spending and saving intentions. The index is a key indicator of consumer confidence and future economic activity."
        },
        {
            "category": "Consumer Indicators",
            "agency": "Manheim",
            "name": "Used Vehicle Value Index",
            "releaseDay": 7,
            "url": "https://www.manheim.com/consulting/used-vehicle-value-index/",
            "march": "210.1",
            "april": "208.2",
            "may": "205.2",
            "june": "208.5",
            "july": "207.4",
            "august": "207.4",
            "september": "207.5",
            "change": "",
            "explanation": "The Manheim Used Vehicle Value Index tracks used vehicle prices at wholesale auctions, providing insight into used car market trends. The index is adjusted for seasonality, mileage, and vehicle mix, with a base of 100 in 1997. Rising values indicate strong demand or limited supply in the used vehicle market, while declining values suggest softening demand. The index is closely watched as used car prices significantly impact inflation measures and consumer spending. The index includes all major vehicle manufacturers and segments, making it a comprehensive measure of the used vehicle market's health."
        },
        {
            "category": "Consumer Indicators",
            "agency": "FRED",
            "name": "Personal Consumption Expenditures (PCE)",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/PCE",
            "march": "20,578.5B",
            "april": "20,662B",
            "may": "20,615B",
            "june": "20,685B",
            "july": "20,802B",
            "august": "21,112B",
            "change": "",
            "explanation": "Personal Consumption Expenditures (PCE) is the primary measure of consumer spending on goods and services in the U.S. economy. Published by the Bureau of Economic Analysis (BEA), it accounts for about two-thirds of domestic final spending and is a key component of GDP. The PCE price index is the Federal Reserve's preferred measure of inflation. Unlike the CPI, PCE includes all consumption expenditures, including those made on behalf of households (like employer-paid health insurance), and uses a formula that accounts for changes in consumer behavior. The PCE report provides insights into spending patterns across various categories, helping economists understand economic growth drivers."
        },
        {
            "category": "Consumer Indicators",
            "agency": "FRED",
            "name": "Dollar Value Index",
            "releaseDay": 0,
            "url": "https://fred.stlouisfed.org/series/DTWEXBGS",
            "march": "126.4",
            "april": "124",
            "may": "122.68",
            "june": "120.97",
            "july": "120.52",
            "change": "",
            "explanation": "The U.S. Dollar Index (DXY) measures the value of the U.S. dollar relative to a basket of foreign currencies, including the euro, Japanese yen, British pound, Canadian dollar, Swedish krona, and Swiss franc. A higher index value indicates a stronger dollar, which makes U.S. exports more expensive and imports cheaper. The index is influenced by interest rate differentials, economic growth, and global risk sentiment. A strong dollar can reduce inflation by making imports cheaper but can hurt U.S. exporters and multinational companies' overseas earnings when converted back to dollars."
        },
        {
            "category": "Trade & Tariffs",
            "agency": "Treasury",
            "name": "Tariff Revenue (Customs Duties)",
            "releaseDay": 0,
            "url": "https://fiscaldata.treasury.gov/datasets/monthly-treasury-statement/summary-of-receipts-outlays-and-the-deficit-surplus-of-the-u-s-government",
            "march": "$8.2B",
            "april": "$16B",
            "may": "$22B",
            "june": "$27B",
            "july": "$28B",
            "august": "$30B",
            "change": "",
            "explanation": "Monthly customs duties collected by the U.S. government on imported goods. Tariffs are taxes imposed on specific categories of imports, often used as a tool of trade policy. Revenue from tariffs goes directly to the U.S. Treasury and can be used to fund government operations. Changes in tariff revenue can reflect shifts in trade volumes, tariff rates, or the composition of imports. Tariff revenue typically increases with new or increased tariffs but may decrease if the tariffs reduce overall trade volumes. This metric is closely watched in trade policy discussions and budget analysis."
        },
        {
            "category": "Trade & Tariffs",
            "agency": "Census",
            "name": "Trade Deficit",
            "releaseDay": 5,
            "url": "https://www.census.gov/foreign-trade/Press-Release/ft900_index.html",
            "march": "$140.5B",
            "april": "$61.6B",
            "may": "$71.5B",
            "june": "$59.1B",
            "july": "$78.3B",
            "august": "TBD",
            "change": "",
            "explanation": "The difference between the value of a country's imports and exports of goods and services. A trade deficit occurs when imports exceed exports. The U.S. has run persistent trade deficits since the 1970s, reflecting strong consumer demand and the dollar's role as the global reserve currency. The trade balance is influenced by exchange rates, economic growth differentials, and trade policies. While a trade deficit can indicate economic strength (strong consumer demand), persistent large deficits may raise concerns about domestic manufacturing and job losses in certain sectors."
        },
        {
            "category": "Government",
            "agency": "CBP",
            "name": "Southern Border Encounters",
            "releaseDay": 0,
            "url": "https://www.cbp.gov/newsroom/stats/southwest-land-border-encounters",
            "march": "11,012",
            "april": "12,024",
            "may": "12,451",
            "june": "9,302",
            "july": "7,824",
            "august": "9,740",
            "change": "",
            "explanation": "The number of individuals encountered by U.S. Customs and Border Protection (CBP) between ports of entry along the Southwest border. This metric includes both apprehensions (individuals taken into custody) and inadmissibles (individuals presenting at ports of entry without proper documentation). The data is reported by CBP and can vary due to seasonal migration patterns, economic conditions in home countries, and changes in U.S. immigration policies. The numbers represent unique encounters and may include multiple encounters with the same individual. This indicator is often used to analyze migration trends and border security effectiveness, though it does not represent total illegal entries, as it doesn't account for those who evade detection."
        },
        {
            "category": "Government",
            "agency": "Treasury",
            "name": "Treasury Debt Level",
            "releaseDay": 0,
            "url": "https://fiscaldata.treasury.gov/datasets/debt-to-the-penny/debt-to-the-penny",
            "march": "$36,216,627,186,278.78",
            "april": "$36,215,156,673,113.80",
            "may": "$36,215,576,799,286.87",
            "june": "$36,214,400,664,854.53",
            "july": "$36,214,482,241,911.14",
            "august": "$37,004,817,625,842.56",
            "september": "$37,499,704,495,767.33",
            "change": "",
            "explanation": "The total outstanding debt of the U.S. government, representing the cumulative amount of money borrowed by the federal government to finance budget deficits over time. This includes debt held by the public (Treasury securities owned by individuals, corporations, and foreign governments) and intragovernmental holdings (debt held by government trust funds like Social Security). The debt level is influenced by annual budget deficits, economic conditions, and interest rates. A growing debt can lead to higher interest payments and potentially crowd out other government spending. The debt-to-GDP ratio is a key metric for assessing the sustainability of government finances."
        },
        {
            "category": "Government",
            "agency": "Treasury",
            "name": "Monthly Budget Deficit",
            "releaseDay": 0,
            "url": "https://fiscaldata.treasury.gov/datasets/monthly-treasury-statement/receipts-and-outlays-of-the-u-s-government-by-month",
            "march": "-$160,528M",
            "april": "+$258,400M",
            "may": "-$315,652M",
            "june": "+$27,010M",
            "july": "-$291,143M",
            "august": "-$344,792M",
            "change": "",
            "explanation": "The difference between government spending and revenue in a given month. A negative value indicates a deficit (spending exceeds revenue), while a positive value indicates a surplus. Monthly deficits can vary significantly due to the timing of tax receipts and government payments. The U.S. typically runs deficits during economic expansions, with larger deficits during recessions due to decreased tax revenue and increased spending on safety net programs. The federal budget is influenced by fiscal policy decisions, economic conditions, and demographic trends. Persistent large deficits can lead to growing national debt and higher interest payments."
        },
        {
            "category": "Government",
            "agency": "Treasury",
            "name": "Tax Revenue",
            "releaseDay": 0,
            "url": "https://fiscaldata.treasury.gov/datasets/monthly-treasury-statement/summary-of-receipts-outlays-and-the-deficit-surplus-of-the-u-s-government",
            "march": "$368B",
            "april": "$850B",
            "may": "$371B",
            "june": "$526B",
            "july": "$338B",
            "august": "$344B",
            "change": "",
            "explanation": "The total amount of money collected by the federal government through various taxes, including individual income taxes, corporate taxes, payroll taxes, and other sources. Tax revenue typically follows a seasonal pattern, with higher collections in April (tax filing deadline) and quarterly estimated payments in January, April, June, and September. Revenue levels are influenced by economic conditions, tax laws, and enforcement. Individual income taxes are the largest source of federal revenue, followed by payroll taxes that fund Social Security and Medicare. Changes in tax revenue can indicate economic health and affect budget deficits."
        },
        {
            "category": "Government",
            "agency": "Treasury",
            "name": "Interest on Debt",
            "releaseDay": 0,
            "url": "https://fiscaldata.treasury.gov/datasets/monthly-treasury-statement/summary-of-receipts-outlays-and-the-deficit-surplus-of-the-u-s-government",
            "march": "$89B",
            "april": "$91B",
            "may": "$86B",
            "june": "$84B",
            "july": "$92B",
            "august": "$93B",
            "change": "",
            "explanation": "The monthly interest expense on the U.S. national debt, as reported by the Treasury Department. This represents the cost of servicing the federal government's outstanding debt obligations, including Treasury bills, notes, and bonds. The amount varies based on the total debt level and prevailing interest rates. Rising interest rates or increasing debt levels can significantly impact this expense. Interest payments are a mandatory part of the federal budget and compete with other government spending priorities. The Congressional Budget Office (CBO) projects these costs will continue to grow as both debt levels and interest rates remain elevated. This metric is a key indicator of fiscal sustainability and the government's debt burden over time."
        },
        {
            "category": "Housing Market",
            "agency": "FRED",
            "name": "Case-Shiller National Home Price Index",
            "releaseDay": 30,
            "url": "https://fred.stlouisfed.org/series/CSUSHPINSA",
            "march": "327.745",
            "april": "329.911",
            "may": "331.446",
            "june": "331.671",
            "july": "331.127",
            "change": "",
            "explanation": "A leading measure of U.S. residential real estate prices, tracking changes in the value of residential housing nationwide. The index uses a repeat-sales pricing technique to measure home price appreciation, comparing the sale prices of the same properties over time. The base value of 100 represents home prices in January 2000. The index is published with a two-month lag and is considered one of the most reliable measures of U.S. home price trends. The data is seasonally adjusted and covers nine U.S. census divisions. The Case-Shiller Index is widely followed by economists, investors, and policymakers as a gauge of housing market health and homeowner wealth effects on consumer spending."
        },
        {
            "category": "Commodities",
            "agency": "CME",
            "name": "Copper Futures",
            "releaseDay": 0,
            "url": "https://www.cmegroup.com/markets/metals/base/copper.quotes.html",
            "march": "4.56",
            "april": "4.65",
            "may": "5.08",
            "june": "5.54",
            "july": "5.55",
            "august": "4.51",
            "change": "",
            "explanation": "The price of high-grade copper futures contracts traded on the COMEX division of the Chicago Mercantile Exchange (CME). Copper is often called 'Dr. Copper' for its ability to predict economic trends due to its widespread use in construction, electronics, and manufacturing. Prices are quoted in US dollars per pound. Copper demand is closely tied to global industrial activity, particularly in emerging markets like China. The metal is also seen as a barometer of global economic health, with rising prices often indicating strong manufacturing activity and economic growth. Copper is highly sensitive to changes in global supply (from mining) and demand (from industrial usage), as well as inventory levels at major exchanges like the London Metal Exchange (LME)."
        },
        {
            "category": "Commodities",
            "agency": "Google Finance",
            "name": "Lumber Futures",
            "releaseDay": 0,
            "url": "https://www.google.com/finance/quote/LBRW00:CME?sa=X&ved=2ahUKEwifpuS0suWOAxWMiO4BHd22BUYQ3ecFegQIIhAT&window=YTD",
            "march": "683",
            "april": "669",
            "may": "584",
            "june": "592",
            "july": "667",
            "august": "690",
            "september": "579",
            "change": "",
            "explanation": "The price of random-length lumber futures contracts traded on the Chicago Mercantile Exchange (CME). Lumber prices are a key indicator for the housing and construction industries, as they directly impact building costs. Prices are quoted in US dollars per 1,000 board feet. Lumber is highly sensitive to housing market conditions, seasonal construction patterns, and weather-related supply disruptions. The market is influenced by factors such as sawmill capacity, transportation costs, and trade policies. Lumber futures are often used by homebuilders, construction companies, and investors to hedge against price volatility. The commodity is particularly important in North America, where wood-frame construction is common for residential housing."
        },
        {
            "category": "Prediction Markets",
            "agency": "Kalshi",
            "name": "FOMC October Rate Decision (BPS)",
            "releaseDay": 29,
            "url": "https://kalshi.com/markets/kxfeddecision/fed-meeting/kxfeddecision-25oct",
            "polymarket_url": "https://polymarket.com/event/fed-decision-in-october?tid=1758147117194",
            "march": "",
            "april": "",
            "may": "",
            "june": "",
            "july": "",
            "august": "",
            "september": "",
            "october": "",
            "november": "",
            "december": "",
            "next_meeting": "October 29, 2025",
            "bps_probabilities": {
                "25BP Decrease": "81%",
                "50+BP Decrease": "3%",
                "No Change": "16%"
            },
            "change": "",
            "explanation": "Prediction market probabilities for Federal Reserve interest rate decisions at the October FOMC meeting. Data aggregated from both Kalshi and Polymarket platforms showing market consensus on potential rate changes measured in basis points (BPS)."
        },
        {
            "category": "Housing Market",
            "agency": "NAR",
            "name": "Existing Home Sales",
            "releaseDay": 22,
            "url": "https://www.nar.realtor/newsroom/existing-home-sales-edged-lower-by-0-5-in-april",
            "march": "",
            "april": "3.99M",
            "may": "4.03M",
            "june": "3.93M",
            "july": "4.01M",
            "august": "4.00M",
            "change": "",
            "explanation": "The seasonally adjusted annual rate of previously owned single-family homes, townhomes, condominiums, and co-ops that closed escrow during the month, as reported by the National Association of Realtors (NAR). Existing home sales account for about 85-90% of total home sales and are a key indicator of housing market conditions. The data includes both cash and mortgage-financed transactions. The report also provides information on inventory levels (measured in months of supply), median and average sales prices, and the share of first-time and all-cash buyers. Existing home sales are recorded at closing, making them a lagging indicator compared to new home sales and pending home sales."
        },
        {
            "category": "Housing Market",
            "agency": "Zillow",
            "name": "Number of Days on Market (Median)",
            "url": "https://www.zillow.com/research/data/",
            "march": "60",
            "april": "53",
            "may": "47",
            "june": "45",
            "july": "47",
            "change": "",
            "explanation": "The median number of days that homes listed on Zillow remain on the market before going under contract. This metric is a key indicator of housing market conditions, with fewer days typically indicating a seller's market and more days suggesting a buyer's market. The data is based on Zillow's database of for-sale listings and is not seasonally adjusted. The metric can vary significantly by location, price point, and property type. A declining trend in days on market often signals increasing demand or limited inventory, while an increasing trend may indicate softening demand or growing inventory. This indicator is closely watched by real estate professionals, homebuyers, and sellers to gauge market competitiveness and pricing strategies."
        },
        {
            "category": "Trade & Tariffs",
            "agency": "Freightos",
            "name": "Shipping Container Rate (China-US 40ft)",
            "url": "https://www.freightos.com/freight-resources/freightos-baltic-index/",
            "releaseDay": 0,
            "march": "$5,200",
            "april": "$5,450",
            "may": "$5,600",
            "june": "$5,750",
            "july": "$6,100",
            "august": "$5,800",
            "september": "$1,802",
            "change": "",
            "explanation": "The Freightos Baltic Index (FBX) tracks the cost to ship a 40-foot container from China to the U.S. West Coast, a key indicator of global trade costs and supply chain conditions. Freightos provides real-time data from major freight forwarders and carriers. These rates are highly sensitive to demand for shipping capacity, fuel costs, port congestion, and geopolitical factors. Sharp increases can indicate supply chain disruptions or strong trade volumes, while falling rates may suggest weakening demand or improving supply chain efficiency. The FBX is updated daily and is widely used by shippers, carriers, and economists to monitor global trade health and predict supply chain costs."
        },
        {
            "category": "Trade & Tariffs",
            "agency": "Port of LA/Long Beach",
            "name": "20ft Equivalents (TEUs)",
            "url": "https://www.portoflosangeles.org/business/statistics/container-statistics",
            "releaseDay": 15,
            "march": "778,405.70",
            "april": "842,806.65",
            "may": "716,618.60",
            "june": "892,339.75",
            "july": "1,019,837.30",
            "august": "958,355.15",
            "change": "",
            "explanation": "A standard measure of cargo capacity, where 1 TEU represents a container 20 feet long. The Port of LA/Long Beach is the busiest port complex in the Western Hemisphere, handling about 40% of U.S. imports. TEU volume is a key indicator of trade flows, consumer demand, and supply chain health. Monthly fluctuations can reflect seasonal patterns, economic conditions, and supply chain disruptions. The data is reported with a one-month lag and is closely watched by economists and businesses for insights into trade trends and potential inventory buildups."
        },
        {
            "category": "Prediction Markets",
            "agency": "Polymarket",
            "name": "US Recession in 2025",
            "releaseDay": 0,
            "url": "https://polymarket.com/event/us-recession-in-2025?tid=1759178395896",
            "kalshi_url": "https://kalshi.com/markets/kxrecssnber/recession/recssnber-25",
            "march": "",
            "april": "",
            "may": "",
            "june": "",
            "july": "",
            "august": "",
            "september": "",
            "october": "",
            "november": "",
            "december": "",
            "yes_probability": "7",
            "no_probability": "94",
            "change": "",
            "explanation": "Polymarket prediction on whether the U.S. will enter a recession in 2025, as defined by the National Bureau of Economic Research (NBER). Current odds show 94 (94%) chance of no recession vs 7 (7%) chance of recession."
        },
     
        {
            "category": "Prediction Markets",
            "agency": "Kalshi",
            "name": "SF @ LA",
            "game_title": "49ers @ Rams",
            "game_time": "TNF - Thu 10/02, 5:15 PM PDT",
            "url": "https://kalshi.com/markets/kxnflgame/professional-football-game/kxnflgame-25oct02sfla",
            "polymarket_url": "https://polymarket.com/event/nfl-sf-la-2025-10-02",
            "sf_win_odds": "30",
            "la_win_odds": "70"  
        }

    ]
}