[
  {
    "date": "6/19/25",
    "entries": [
      {
        "title": "NYT's Donor State Contradiction",
        "content": "NYT is flawed, arbitrary, and counterintuitive to claim that the Donor State concept is 'flawed, arbitary, and counterintuitive' but then share a prominent table showing Blue States as Donor states. Ascribe to the concept or don't. But you did."
      },
      {
        "title": "Introducing unverified <a href=\"https://x.com/docriter\">@DocRiter</a>",
        "content": "There's this guy here at HS who is full of commentary and we try to shut him up so we've moved him from the Welcome page to an Opinion section just for him. Now to the back fold of the Journal section within the Read Section. Keep your mouth shut, young man!"
      },
      {
        "title": "Rent Control Market Distortions",
        "content": "NYT states that 1M rent-controlled landlords net operating income was up 12.1% and that they're, 'actually doing pretty well.' Big thing missing. Just a major fact. Missing. Landlords costs are down because they're not investing in their properties. They aren't spending or are disclosing the smallest costs to justify whatever increases they can get under state control. State intervention will always have adverse market incentives. Remove the state and a Fair Market Rent and a Free Market system will fascilitate price discovery. Landlords will invest and tenants will get better deals. More compliance costs, more state intervention, and you get HIGHER PRICES."
      }
    ]
  },
  {
    "date": "6/17/25",
    "entries": [
      {
        "title": "Money vs Independence",
        "content": "Accept money or retain independence?"
      }
    ]
  },
  {
    "date": "6/7/25",
    "entries": [
      {
        "title": "Social Media Warning",
        "content": "reminder to myself: Be careful with social media. It is addictive and can cause reprioritization."
      }
    ]
  },
  {
    "date": "5/13/25",
    "entries": [
      {
        "title": "Github as Social Platform",
        "content": "tweeting on Github feels like how it should be. creators hanging with other creators. agency. no sycophants."
      }
    ]
  },
  {
    "date": "5/12/25",
    "entries": [
      {
        "title": "Defender Dreams",
        "content": "I want a Defender so I can drive on top of dunes and up streams to waterfalls and up steps to Tudor homes."
      }
    ]
  },
  {
    "date": "5/9/25",
    "entries": [
      {
        "title": "Nob Hill Evening Observations",
        "content": "Nob Hill<br>Asian Man Black shoes<br>Rolls Royce Dusty top<br>Long shadows on a Friday night bench<br>A laundromat (closed for repair) with empty windows<br>An Acura parked long term. A tucked ticket.<br>Clipping heals to date night.<br>Gas engines purring from stop signs.<br>Wandering elderly man in sneakers, jeans, and a sweatshirt.<br>A crew, 'for me to be happy in the city…'<br>Sitting still is not easy.<br>The world passes you by and it's completely indifferent.<br>The sun feels nice and the cable cars creak; comfort in cacophony and cacophony in comfort.<br>A weird word. A weird world."
      }
    ]
  }
]