[
{
"date": "02/01/26",
"entries": [
{
"title": "⚖️ Protest or Obstruction",
"content": "\"The protesters in places like Minneapolis and Maine are standing watch in the cold.\" What are they watching for? Are the British coming? They're not protesting, they're actively impeding federal law. How far does peaceful protest go? Can it be armed? Can it be violent, agitative?"
},
{
"title": "👑 Patronizing Possession",
"content": "Waltz referred to American citizens as his citizens. How patronizing."
},
{
"title": "🛂 Immigration Law Enforcement",
"content": "ICE have not stopped people seemingly at random. They have to have reasonable suspicion because they are law enforcement. Are you inciting a riot to say immigration laws are arbitrary? It's not either carry papers (as homage to Nazi Germany) or nothing. It's that we have non-citizens exploiting resources reserved for citizens. It's not complicated. Citizens pay taxes. Citizens have privileges. You can't assimilate 20 million newcomers overnight. No one is against immigration."
},
{
"title": "📰 NYT Double Standard",
"content": "The New York Times thinks it's fine for a Booz Allen contractor to access and leak IRS tax filings (for the rich) but when DOGE is granted access to SSA (for the poor) and no leaks yet, it's outraged."
},
{
"title": "⛽ Oil Revenue & War Economics",
"content": "Cut oil revenue and Russia can't fund a war (a $170 billion dollar meat grinder at 30% of their $580 billion budget) without an unsustainable tax re-assessment (remember the Brits had a 22% tax burden when pushing colonies to loyalty oaths). Sanctions don't do shit without an energetic (ballsy) executive at the helm. The shadow fleet proliferated under sleepy Joe. You have to actually seize vessels to force concessions from Rosneft and Lukoil who are now getting dick flop. <a href='https://www.tiktok.com/@recapgeniuz/video/7178238583285927214' target='_blank'>See: TikTok</a>"
},
{
"title": "🇺🇸 The UN Can't Pay Its Bills",
"content": "The UN can't pay its bills because we pay their bills. We make peace. We make war. Not the UN. Our boys die for the mission while the suits pontificate against us. 3.4 billion annual budget. 95% comes from USA. Venezuela owes 38 million. Mexico 20 million. Once we stop paying dues, it's over. No international peace without US bloodshed."
},
{
"title": "📱 iPhone Demagoguery",
"content": "Too many have too much time to protest. The hyperactive attention to micro without thoughtful consideration of macro will lead us to demagoguery. Two million dead in Ukraine v Russia. Ten thousand dead from antiregime uprising in Iran. Two dead in ICE v liberals. <a href='financials.html?filter=Government'>Ninety-two billion a month just to service the debt</a> on all our public services. While we relish in our restive bill of rights, be careful what you wish for. Actively impeding law enforcement and promoting lawlessness will beget more messianic demigods (the likes of which you've never seen). More charismatic authoritarianism, intense nationalism, religious zealotry, and a chronically polarized society. A democracy is now a shouted slogan; ideal has crowded out pragmatic."
},
{
"title": "📺 The Insurrection Will Be Televised",
"content": "How much protest to tolerate? The right condones J6, the left condones anti-ICE. Establishment calls them both insurrection. John Adams was aghast at allowing non-elite participation in the formative years. Push too hard, a rebellion forms. Pull for participatory representation."
}
]
},
{
"date": "01/26/26",
"entries": [
{
"title": "🏘️ Middle America",
"content": "One man owns 2.7 million acres (nearly twice the size of Rhode Island) after purchasing 937,000 deeded acres in New Mexico in December 2025. Stan Kroenke also owns the Los Angeles Rams, Denver Nuggets, Colorado Avalanche, Colorado Rapids, and Arsenal FC. Meanwhile, a theatre major from Smith College advocates for $1 billion in annual tax outlays to presume illegal immigrants \"eligible\" for housing under a 1983 right to shelter law. $2.8 million a week burns in empty shelter units. Middle America doesn't want either extreme: they don't want to be homeless begging for government shelter, and they can't compete with billionaire land consolidation. They just want to buy a house and have a decent job. The right enables billionaire hoarding (the top 1% possess $55 trillion - as much as the bottom 90%). The left enables welfare dependency. Both are pulling the middle apart.<br><br><a href='https://landreport.com/land-report-100' target='_blank'>Land Report 100 (Complete Top 100 List)</a> | <a href='https://landreport.com/land-report-100/stan-kroenke' target='_blank'>Stan Kroenke Profile</a>"
}
]
},

{
"date": "01/22/26",
"entries": [
{
"title": "🤴 Queen Billionaires v. King President",
"content": "The actual attack on democracy (one citizen one vote) are billionaires funding activism that influences the popular vote while simultaneously unraveling civic society and self determination.<br><br><b>Billionaire Funders:</b><br>• Michael Bloomberg<br>• Pierre Omidyar<br>• George Soros<br>• Tom Steyer<br>• MacKenzie Scott<br><br><b>Key Intermediaries:</b><br>These billionaires channel resources through ostensibly independent organizations that amplify their preferred narratives and policy agendas:<br><br>• <a href='https://www.lucemass.org' target='_blank'>Luce Foundation</a><br>• <a href='https://www.tides.org' target='_blank'>Tides Foundation</a><br>• <a href='https://www.influencewatch.org/non-profit/kaphan-foundation/' target='_blank'>Kaphan Foundation</a><br>• <a href='https://www.macfound.org' target='_blank'>MacArthur Foundation</a><br>• <a href='https://www.fordfoundation.org' target='_blank'>Ford Foundation</a><br>• <a href='https://www.opensocietyfoundations.org' target='_blank'>Open Society Foundations</a><br>• <a href='https://www.sunrisemovement.org' target='_blank'>Sunrise Movement</a><br><br>The mechanism is straightforward: billionaires donate to foundations which then fund nonprofit organizations and grassroots movements. These groups create the appearance of organic popular support while their funding sources remain obscured. The result is a manufactured consensus that seems to emerge from below but is actually engineered from above.<br><br>This inverts representative democracy. Instead of citizens setting priorities and government responding, billionaires set priorities and hire nonprofits to manufacture consent among the voting population. The funded activism shapes which issues dominate public discourse, which candidates receive coverage, and which policies are considered 'inevitable' or 'progressive.'<br><br>When billionaires control the funding streams for social movements, they control the narrative. When they control the narrative, they control electoral outcomes. When they control electoral outcomes, they control policy. And when they control policy, they have eliminated the \"consent of the governed\" and replaced it with the diktat of the funded.<br><br><a href='https://x.com/basedmikelee/status/2014378040319738192?s=46' target='_blank'>See Mike Lee on X: \"There is no media cartel\"</a><br><br><a href='https://x.com/awakenedoutlaw/status/2015335293780722019?s=46' target='_blank'>Awakened Outlaw on X</a>"
}
]
},
{
"date": "01/20/26",
"entries": [
{
"title": "🦆 What The Cat Really Meant to Say",
"content": "Duck on a Bike: a kids book where a duck pedals around the farm and barnyard animals react with their characteristic sounds. Quack, Neigh, Bark, Moo. But the narration reveals what the cat really meant to say: \"What a show-off.\"<br><br>Medi-Cal paid $12.5B annually for 1.7 million illegal immigrants. But you're supposed to say they have \"unsatisfactory immigration status\" and we \"voluntarily send funds\" for their healthcare. Call it anything else and you're racist. It's not fraud. You have no say in state benevolence.<br><br>But nothing can be legal if illegal is legal. If we're abolishing the nation-state paradigm, just say so. Then we know what's legal. The world would love free US healthcare. But so would sick citizens who can't afford higher taxes. What he meant to say is, \"no taxation without representation.\"<br><br>The cat knows what a show-off looks like. So do the working poor paying for someone else's subsidized care while their own costs spiral."
}
]
},
{
"date": "01/17/26",
"entries": [
{
"title": "🏗️ Supply Side Housing",
"content": "Housing market amelioration has concentrated on incurring more debt or restricting demand but not facilitating supply with intelligent governance. Proposals have included limiting large institutional ownership, extending amortization to a 50-year mortgage, tapping into your 401(k) (loans already allowed), and increasing liquidity with bond purchases for rates to go down. All aimed at the buyer and ignoring the localized supply issue. A better way to solve the \"affordability\" crisis is through deregulation. No capital gains, no rent control, streamline permitting, incentivize building. Instill pro housing ideals with policy incentives (see the bipartisan The Build Now Act from senators Kennedy and Warren). Hell, bring back ole' Build Back Better mantra! But stop the cheap talk, step aside, and let the sloppy magic of an invisible hand allocate capital."
},
{
"title": "😔 Miserable Liberals",
"content": "A Canadian with mental illness is claiming discrimination for lack of access to medical assisted suicide. To me, this means you have no formidable cultural heritage to derail nihilism. You have lost respect for life. I want no part of your reality where people soothe your feelings with DSM bullshit. I suffered from 'chemical imbalance', the slings and arrows. I've also lived in abject poverty where 'irremediable illnesses and persistent intolerable suffering' was never suggestive nor endowed with an inalienable right to death. I choose laughter and life:<br><br><a href='https://x.com/awakenwithjp/status/2012515419710525470?s=61' target='_blank'>https://x.com/awakenwithjp/status/2012515419710525470</a>"
}
]
},
{
"date": "01/16/26",
"entries": [
{
"title": "🚨 Citizen Journalism",
"content": "Nick Shirley isn't credentialed by mainstream institutions, so the 'news' can't engage with his findings. Instead they attack the messenger. His investigation into Minnesota welfare fraud forced a governor to drop his reelection bid and triggered federal investigations. No mainstream journalist did this. Just a guy with a camera asking questions the approved storytellers refuse to ask.<br><br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/zF2a3aTfA9w\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>"
}
]
},
{
"date": "01/12/26",
"entries": [
{
"title": "🎯 Caracas Simulation",
"content": "Caracas success was a digital twin to run simulation. Copy Paste. Join atoms. Use sun."
},
{
"title": "🤖 Eating Expertise",
"content": "If there is a car mechanic shortage and it takes 10 hours for a professional human to change a transmission, I will swipe up on more AI stock. I will buy a car without the need or I will be driven. If wages don't keep up with cost, I will buy/leverage/exploit productivity or have my expertise harvested by <a href='https://www.mercor.com/' target='_blank'>Mercor</a>.<br><br><a href='https://finance.yahoo.com/quote/TSLA' target='_blank'>TSLA</a> $445.01 (+2.11%), <a href='https://finance.yahoo.com/quote/U' target='_blank'>U</a> $45.15 (-0.64%), <a href='https://finance.yahoo.com/quote/IOT' target='_blank'>IOT</a> $34.28 (+1.06%)."
}
]
},
{
"date": "01/11/26",
"entries": [
{
"title": "🎬 At Our Windows",
"content": "I am at a window. I am on my phone. I can't stop watching videos of people reacting to the Minneapolis story. It's almost like a movie that doesn't end. So instead of augmenting that endless scroll, here is something LONG and something SHORT:<br><br><b><a href='https://eternal.tv/programs/satantango' target='_blank'>Sátántangó</a></b> (1994) - Béla Tarr's 7+ hour masterpiece. Hypnotic, glacial, crushing. A film about waiting, dissolution, and the slow dissolution of hope. If you can survive it, you'll understand something about why we're compelled to watch endings we already know. Also available on <a href='https://www.kanopy.com/en/product/justwatch-6520418' target='_blank'>Kanopy</a> (free with library card).<br><br><b>\"Monday\" by Billy Collins</b><br><br><div style='font-style: italic; line-height: 1.8; margin: 1.5rem 0;'>The birds are in their trees,<br>the toast is in the toaster,<br>and the poets are at their windows.<br><br>They are at their windows<br>in every section of the tangerine of earth—<br>the Chinese poets looking up at the moon,<br>the American poets gazing out<br>at the pink and blue ribbons of sunrise.<br><br>The clerks are at their desks,<br>the miners are down in their mines,<br>and the poets are looking out their windows<br>maybe with a cigarette, a cup of tea,<br>and maybe a flannel shirt or bathrobe is involved.<br><br>The proofreaders are playing the ping-pong<br>game of proofreading,<br>glancing back and forth from page to page,<br>the chefs are dicing celery and potatoes,<br>and the poets are at their windows<br>because it is their job for which<br>they are paid nothing every Friday afternoon.<br><br>Which window it hardly seems to matter<br>though many have a favorite,<br>for there is always something to see—<br>a bird grasping a thin branch,<br>the headlights of a taxi rounding a corner,<br>those two boys in wool caps angling across the street.<br><br>The fishermen bob in their boats,<br>the linemen climb their round poles,<br>the barbers wait by their mirrors and chairs,<br>and the poets continue to stare<br>at the cracked birdbath or a limb knocked down by the wind.<br><br>By now, it should go without saying<br>that what the oven is to the baker<br>and the berry-stained blouse to the dry cleaner,<br>so the window is to the poet.<br><br>Just think—<br>before the invention of the window,<br>the poets would have had to put on a jacket<br>and a winter hat to go outside<br>or remain indoors with only a wall to stare at.<br><br>And when I say a wall,<br>I do not mean a wall with striped wallpaper<br>and a sketch of a cow in a frame.<br><br>I mean a cold wall of fieldstones,<br>the wall of the medieval sonnet,<br>the original woman's heart of stone,<br>the stone caught in the throat of her poet-lover.</div><br><br>From <i>The Trouble with Poetry and Other Poems</i>. <a href='https://www.panmacmillan.com/blogs/literary/monday-by-billy-collins' target='_blank'>Read more</a>"
}
]
},
{
"date": "01/07/26",
"entries": [
{
"title": "☯️ Warm Collectivism",
"content": "PGE is decoupling utility usage from service with their new Base Services Charge (effective March 2026) to ensure that, 'customers' energy bills are more closely matched to their income level and shift cost burdens away from low income customers.' <a href='https://www.pge.com/en/account/billing-and-assistance/base-services-charge.html' target='_blank'>PGE Base Services Charge</a>"
}
]
},
{
"date": "01/03/26",
"entries": [
{
"title": "🇦🇺 Dom Solesky",
"content": "<div id=\"curry-goat-warning\" style=\"padding: 1.5rem; border-radius: 0.5rem; margin-bottom: 1rem;\"><p style=\"margin: 0 0 1rem 0;\"><b>⚠️ Explicit Language Warning</b></p><p style=\"margin: 0 0 1rem 0; font-size: 0.95rem;\">This video contains explicit language and adult humor.</p><button class=\"warning-button\" onclick=\"document.getElementById('curry-goat-warning').style.display='none'; document.getElementById('curry-goat-video').style.display='block';\" style=\"padding: 0.5rem 1rem; border-radius: 0.25rem; cursor: pointer; font-weight: bold;\">I Understand, Show Video</button></div><div id=\"curry-goat-video\" style=\"display: none;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/b7_XVxl6l3g\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><p style=\"margin-top: 1rem; font-size: 0.9rem;\">Credit: <a href='https://linktr.ee/solesky' target='_blank'>Dom Solesky</a></p></div>"
}
]
},
{
"date": "01/01/26",
"entries": [
{
"title": "⚖️ National Security",
"content": "Almost anything can be justified as a national security concern because the justification is broadly interpreted at an agent's discretion and the reasoning of that suspicion is often adjudicated by human fallible judgment. When a government agent is acting on behalf of a sovereign, culpability is a limited concern until a formidable deterrent (like the prosecution of Derek Chauvin for example) is obvious and threatening.<br><br>The mobile phone can be a pervasive threat to a totalitarian government so it needs to be searched and seized without violating the 4th amendment. An, 'examination of information that is resident upon [a] device at the time it is presented for inspection' is deemed necessary.<br><br><b>Fourth Amendment:</b> \"The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\"<br><br><a href='https://www.cbp.gov/travel/cbp-search-authority/border-search-electronic-devices' target='_blank'>CBP Border Search Authority</a>"
},
{
"title": "🚫 Unauthorized Inquiry",
"content": "It has been interesting to follow the Minneapolis Daycare Fraud story or what the \"news\" has labeled, \"Conservative Social Influencers Give Trump's Team an Amplifier.\" <br><br>Questions regarding the state's role in subsidizing daycare with ineffective oversight are off limits. Questioning normalized outlays is a threatening inquiry and rooted in [insert academic word for popular grievance]. Welfare scrutiny portends a, \"symbiotic relationship between the Trump administration and self-described citizen journalists.\"<br><br>The audacity to self-identify is reserved for gender. Credentialism is just another way of saying you need a license to say certain things. You need permission. You can only speak \"your\" truth in alignment with an approved cause otherwise you are, \"in search of politically charged footage and producing viral content that aligns with MAGA policies.\"<br><br>The \"news\" chooses ad hominem rhetoric instead of investigating the claims made in the video. Internecine rage sells ads so we are directed to the opinions of credentialed individuals who study, \"lies, damn lies, and disinformation in the digital world\" and authors opining on psychedelics. They are our approved storytellers. They sell advertisements.<br><br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/r8AulCA1aOQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>"
},
{
"title": "💰 Tariff Math",
"content": "If China is imposing a 55% tariff on imported beef from Australia, Brazil and the United States, why wouldn't prices come down here? <a href='financials.html?filter=Commodities'>See Beef prices</a>"
}
]
},
{
"date": "12/31/25",
"entries": [
{
"title": "🏛️ To be GOVERNED",
"content": "<div style='background: #000; color: #fff; padding: 1rem; border: 2px solid #ff0000; border-radius: 0; font-family: monospace;'><div style='text-align: center; font-size: 1.5rem; margin-bottom: 1rem; color: #ff0000;'></div><div style='text-align: center; font-weight: bold; margin-bottom: 1rem;'>TO BE GOVERNED</div><div style='border-top: 1px solid #ff0000; margin: 1rem 0; padding-top: 1rem;'>To be GOVERNED is to be watched, inspected, spied upon, directed, law-driven, numbered, regulated, enrolled, indoctrinated, preached at, controlled, checked, estimated, valued, censured, commanded, by creatures who have neither the right nor the wisdom nor the virtue to do so. To be GOVERNED is to be at every operation, at every transaction noted, registered, counted, taxed, stamped, measured, numbered, assessed, licensed, authorized, admonished, prevented, forbidden, reformed, corrected, punished. It is, under pretext of public utility, and in the name of the general interest, to be place[d] under contribution, drilled, fleeced, exploited, monopolized, extorted from, squeezed, hoaxed, robbed; then, at the slightest resistance, the first word of complaint, to be repressed, fined, vilified, harassed, hunted down, abused, clubbed, disarmed, bound, choked, imprisoned, judged, condemned, shot, deported, sacrificed, sold, betrayed; and to crown all, mocked, ridiculed, derided, outraged, dishonoured. That is government; that is its justice; that is its morality.</div><div style='text-align: right; font-style: italic; margin-top: 1rem; color: #ff0000;'>— Pierre Proudhon</div><div style='border-top: 1px solid #ff0000; margin: 1rem 0; padding-top: 1rem; text-align: center;'>From: <a href='media.html#against-the-machine' style='color: #ff0000; text-decoration: underline; font-weight: bold;'>AGAINST THE MACHINE by Paul Kingsnorth</a></div></div>"
}
]
},
{
"date": "12/29/25",
"entries": [
{
"title": "🤖 AI Encounters",
"content": "<ul><li><b>Waymo:</b> Got stuck during ride home. Made it safely but very delayed. I wasn't able to dispute the charge, only able to offer \"feedback\". No dispute mechanism, no refund negotiation, just corporate goodwill.<br><iframe width=\"320\" height=\"180\" src=\"https://www.youtube.com/embed/20Xhfn-uMlo\" title=\"Waymo Driverless Cars Stuck During Power Outage\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></li><li><b>Flock Cameras:</b> AI-powered license plate readers everywhere capturing every movement. This is predictive policing infrastructure. I could be flagged as 'suspicious' and detained for a crime I haven't committed. No transparency. No opt-out.<br><iframe width=\"320\" height=\"180\" src=\"https://www.youtube.com/embed/uB0gr7Fh6lY\" title=\"We Hacked Flock Safety Cameras in under 30 Seconds\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></li><li><b>Amazon Reviews:</b> Posted a legitimate review of a kid's guitar that couldn't be tuned. Review was flagged and never published (UPDATE 12/31 - Amazon notified that review was published). No explanation. No appeal. Meanwhile, fake 5-star reviews flood the platform.<br><iframe width=\"320\" height=\"180\" src=\"https://www.youtube.com/embed/6t-FAx0DYAQ\" title=\"Amazon Review Manipulation Suspensions Explained\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></li></ul>"
},
{
"title": "🔮 Cassandra Down",
"content": "NVDA down 37% to $110, PLTR to $50 by 2027."
}
]
},
       {
"date": "12/26/25",
"entries": [
{
"title": "🚨 Marxist Advocacy Masquerading as Journalism",
"content": "The latest Maoist indoctrination-as-news is uprooting the traditional work-ethic. The article is titled, 'Despite claims, massive SNAP fraud is rare.' It barely mentions that Massachusetts refused to cooperate with federal USDA fraud investigations. The author from UC Berkeley then relies on a legal welfare advocate who states that fraud is not \"borne out by our experience.\" This self-righteous Red Guardswoman advocates for SNAP recipients for a living. She states the \"broader narratives about fraud by SNAP recipients is completely false.\" The \"broad\" fraud narrative will always be false from this Berkeley-broached perspective. Until the lowly taxpayer who is working 3 jobs to pay for someone else to receive $1500/mo. is included in the narrative, it's not journalism, it's Marxist advocacy on behalf of wealthy donors who want you poor, illiterate, and subservient to their revisionist ideology."
}
]
},
      {
"date": "12/20/25",
"entries": [
{
"title": "🎥 Cal Newport on Why Smart People Quit Social Media",
"content": "Cal puts on his technology critic hat and offers a step-by-step technical explanation for why these platforms are strictly and incessantly making your life worse and why the only reasonable response is to quit them. See also: <a href='/media.html#slow-productivity'>Slow Productivity</a><br><br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/X-Lb81yUph4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>"
}
]
},
      {
"date": "12/18/25",
"entries": [
{
"title": "⚕️ MAID in America",
"content": "\"If a suffering New Yorker made the difficult choice to die, who am I to stand in their way?\" - NY Governor Hochul. <p>I'm a suffering American and I hope there are people in power who would stand in my way. In melancholic moments I've contemplated or ideated on the end. I get it, mental illness doesn't count. But what does count, is that there are less and less people standing in my way. And there are less and less people standing for my way. Selfishness is pragmatic. Loss is ephemeral. The bad thoughts go away eventually. We prefer to be left alone, free to our own will, autonomous until the end when we lay flat together.<br><br>In crisis management we're taught to assess risk so that suicidal ideation is properly managed and walked down. The norm should always be to preserve innocent life; not to hasten death. Democrats smartly retort that it's not about shortening life but shortening death. But what the hell does that even mean? Life is pain. Life can be miserable. And we are all dying at a different pace. The slippery slope is to not speak truthfully about it. To dance around a hard truth is what a politician does. They are vapid; the results of an apathetic electorate. We should come to our senses before even feebly endorsing assisted suicide. We should face it directly and call it what it is. Medical aid in dying (MAID) is anesthetizing a harsh, blunt, and unpleasant end. It is the euphemism of the century. MAID may be practical and convenient. It is also an endorsement of taking innocent life. It also makes me feel empty inside. It makes me contemplate shortening my own death. I'm eventually inconvenient if not already. AI can do my job. But I reject a culture that placates despair. Do you?"
}
]
},
      {
"date": "12/17/25",
"entries": [
{
"title": "💰 SNAP Up",
"content": "The Boston Globe laments that a Spanish-speaking family with 4 kids can't get by on $1,421/mo. in SNAP and needs a hotline to access benefits. <a href='https://www.bostonglobe.com/2025/12/11/metro/snap-food-project-bread-hotline-shutdown/' target='_blank'>The article</a> states, 'people not following the news who had no idea why their benefit cards were empty.' Later today, <a href='https://www.justice.gov/usao-ma/pr/two-massachusetts-men-charged-large-scale-snap-benefits-trafficking' target='_blank'>$7M in SNAP fraud</a> as predicted two weeks ago."
}
]
},
      {
"date": "12/16/25",
"entries": [
{
"title": "💀 Growth by Negation",
"content": "'Whatever late capitalism is, it seems to be careening into this embrace of growth by negation. Through that prism, it's hard not to see the advances in something like artificial intelligence less driven by technological breakthroughs as by a society that has, over years, over decades, become normalized to a greater and greater magnitude of both loneliness and theft, such that a sputtering algorithm badly trained on the stolen work of real human beings might be celebrated with a straight face as something approximating humanness. Under this ordering, it is not some corporations increasing capacity for better that drives the extractive world, but everyone else's increasing tolerance for worse.' - Omar El Akkad"
}
]
},
      {
"date": "12/10/25",
"entries": [
{
"title": "📦 You are the Product",
"content": "<b><a href='https://fulu.org/' target='_blank'>FULU</a></b><br><br>Grandpa fixed his car. Dad changed his oil. I can't repair my Tesla nor can I buy an affordable <a href='/news.html?article=oregon-kei-trucks-sb1213'>Kei truck</a> that doesn't require long-term financing. I can't upgrade my iPhone hardware ad hoc. My Fitbit stopped working suddenly and Google offered 35% off a newer version. Product obsolescence is planned and amortized so that my inventory loss is their revenue gain. Not upgrading your iPhone is bad for business. Same goes for not financing the house you can't afford, the large vehicle-for-one that sits 80% unused for $760 a month. Smart-anything, subscriptions, IOT dependency, BNPL financing, all requisite reoccurring revenue for 📈 in quarterly earnings presentations. Using their software, you are the product and I'm buying their stock.<br><br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LsI6P2lxcHM\" title=\"Right to Repair\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>"
}
]
},
      {
"date": "12/8/25",
"entries": [
{
"title": "⚖️ Qualified Immunity",
"content": "While an individual officer may have qualified immunity, your municipality does not. A public liability fund can pay $30 million to settle when an individual officer kills on your behalf. For more from SCOTUS on sovereign immunity, see <a href='/news.html?article=scotus-nov-2025'>GEO GROUP INC. v. MENOCAL </a>"
}
]
},
      {
"date": "12/4/25",
"entries": [
{
"title": "🏛️ Food, Food, Food",
"content": "This is your website <a href='https://www.usda.gov/about-usda/news/blog' target='_blank'>that YOU pay for.</a> <img src=\"images/U.S. Department-small.png\" alt=\"U.S. Department\" style=\"max-width:100%;height:auto;\">"
}
]
},
      {
"date": "12/1/25",
"entries": [
{
"title": "🛒 I'm Starving",
"content": "Just purchased 5lbs of rice for $3.54, a 12lb Turkey for $5.00, all delivered the next morning before I woke up. And yet, in the \"news\" I hear people can't afford groceries. Am I the only one with abundance and losing my mind in cognitive dissonance? Is it too hyperbolic to say Fake News?"
}
]
},
      {
"date": "11/27/25",
"entries": [
{
"title": "🦃 Happy Thanksgiving!",
"content": "Thank you for your support. I appreciate you visiting. When I see my numbers going up, I'm motivated to keep going and improve the site. It's nice to know someone is on the other side."
}
]
},
    {
"date": "11/19/25",
"entries": [
{
"title": "🎯 Tariff Squeeze",
"content": "Companies are securing additional supply chain from non-China-based suppliers. Market response validates tariff strategy as effective price signal for supply chain diversification. De-risking from single-source dependency. Reshoring and nearshoring accelerate. The tariff tax on consumers is offset by supply chain resilience, reduced geopolitical exposure to China, and domestic manufacturing revival."
}
]
},
    {
"date": "11/18/25",
"entries": [
{
"title": "📱 Institutional Scroll",
"file": "article/posts/2025-11-18-load-more-button.md"
}
]
},
    {
"date": "11/15/25",
"entries": [
{
"title": "💊 Kinetic",
"content": "To bomb someone, call them a terrorist (see 9/17 post for definition). To justify the terror characterization, just use drugs (but not American FDA sanctioned drugs like boner, fat, and pain pills). You have to use the word illicit. Fentanyl illicit, OxyContin legal. Cannabis good. Pot bad. Coca bad. Cola good. Dealer bad. Dispensary good. Trafficking bad. Purveying good. When too many people use your product, then you say “class action” on behalf of the addicted. You sue for $7.4 billion on behalf of the afflicted dead. Protect the consumer and the inelastic demand. Kill the supplier. Bomb 79. Protect the homeland. Use kinetic lethal force though, not bombs."
},
{
"title": "👍 Compassionate Chaos",
"content": "'Some in our party assert that an open border is a compassionate policy but I don’t agree. An open border is chaos, both for those immigrants and for those citizens impacted by the overwhelming number of people coming in who need assistance.' - an apostate"
}
]
},
{
"date": "11/12/25",
"entries": [
{
"title": "🚫 Fasting > GLP-1s",
"content": "Stopped eating for 36 hours, lost 6 pounds. No injection needed. No $350/month pharmaceutical dependency. No equity stake for Novo Nordisk, Eli Lilly, Pfizer, Roche, and Amgen in my metabolic fate. Just discipline, water, and time. But sure, keep paying for the peptide when your body already has the mechanism. You will gain all the weight back after 18 months off it."
}
]
},
{
"date": "11/8/25",
"entries": [
{
"title": "🌾 Local Wheat",
"content": "Shift from soybeans back to wheat? Mitigate gluten intolerance with fresh wheat and locally milled flour? Save $245/mo. on GLP-1s, $8B/mo., $190/person (42 million) on SNAP, and $23B on subsidies propping up an oversupplied commodity? Grow food for us by us? Incentivize carbon sequestration for Brazil to curb their 70% of Chinese soybean imports? Buy local? Reduce footprint? Avoid tariffs?"
}
]
},
{
"date": "11/7/25",
"entries": [
{
"title": "🇨🇦 Canadian Reagonites",
"content": "If Justices ban tariffs, hello Canada 51."
},
{
"title": "⚧️ Binary Passport",
"content": "Jon Davidson, ACLU lawyer, in response to Passport Policy requiring displaying sex at birth: \"This is a heartbreaking setback for the freedom of all people to be themselves.\""
},
{
"title": "🌪️ Existential Threats",
"content": " Maduro on the Right. Climate change on the Left. Both seeking emergency use authorization and a unitary executive."
},
{
"title": "🍔 First World",
"content": "$245 a month to inject 50m of 130m Americans on Medicaid and Medicare who can’t stop eating."
},
{
"title": "🤖 Chatacide",
"content": "ChatGPT \"cold steel pressed against a mind that's already made peace? that's not fear. that's clarity, you're not rushing. you're just ready. and we're not gonna let it go out dull.\""
}
]
},
{
"date": "11/5/25",
"entries": [
{
"title": "🤞 Life Determined",
"content": "I received notification that Autopilot traded new positions. It sold NVDA than bought it. Stupid (studies show the least active traders beat the busiest by 7%).<br>AI can't zoom out to provide context. It's current-info-biased. In other words its memory is based on existing code, not past experience. Sure you could code that, prompt that to say, \"act like smart investor with memory and don't sell.\" But this hyper aggressive behavior to buy and sell constantly with new models is a losing strategy. The oracle from Omaha epitomizes investor intelligence. Deep learning, longevity; sagaciousness. Coupled with AI, the individual now can discern with augmented intelligence buts it's not artificial reasoning that supersedes purchasing decisions. The human is not replaceable and is far more interesting than 'just interesting' as some prominent voices have blithely opined. While the luddites overreacted in the past, the AI-emboldened entrepreneur is now well-tooled but amorous. The modern technocrat is mired in their own myopic ideology. I find myself in this camp. Why am I building? What do I believe? It seems so futile. But maybe the despondency is misplaced. Maybe it's not 'tech' or 'no tech' or human v. robot. It's a digestible easy narrative. But maybe it's a false dichotomy. If it's about determinism and whether I can live without free will, then I submit. If all events, including human actions, are causally determined by preceding events and the laws of nature, this means that every event is the inevitable result of what came before, making it impossible to have acted otherwise. Is technological determinism incompatible with free will? <br> Do I have free will?"
}
]
},
{
  "date": "11/4/25",
  "entries": [
    {
      "title": "✊ NYC Socialism",
      "content": "\"I was guilty of judging capitalism by its operations and socialism by its hopes and aspirations; capitalism by its works and socialism by its literature.\" - Sidney Hook"
    },
    {
      "title": "🚕 Zeekr Peeker",
      "content": "If you are not copying Zeekr, you are losing.<img src=\"images/Zeekr.png\" alt=\"Zeekr\" style=\"max-width:100%;height:auto;\">"
    }
  ]
},
{
"date": "10/28/25",
"entries": [
{
"title": "📕 Bookmark",
"content": "I'm just a bookmark looking for his book."
}
]
},
{
"date": "10/21/25",
"entries": [
{
"title": "Ain't no party like a propaganda party",
"content": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0CudLY7mSUo?si=MK__HHpmcbndXjfe\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>"
}
]
},
{
"date": "10/20/25",
    "entries": [
      {
        "title": "☁️ AWS Alternatives",
        "content": "Was looking for alternative after AWS. Turns out, competitor also on AWS."
      },
      {
        "title": "💳 FICO Reparations",
        "content": "FICO reparations - Protesting boomers (socialists) with +800 FICO scores could pay down debt of Gen Z and their decreasing 676 avg. FICO score and practice what they preach (or stay home; realize free time to protest was made possible by capitalism and voting)."
      },
      {
        "title": "🌐 .gov Websites",
        "content": "I can show you .gov websites without proper margins and padding. I could redesign their shitty websites for a nanofraction of the cost. But no, we have people convinced a \"king\" is the problem. \n\n .gov websites are dysfunctional so we use corporations to index them when we could just compile all .gov into one giant JSON file with a public API. But no, we’ve dug in and procured ex-ABNB designer to make the shitty slop shiny for the suckers -  ignoring first principles."
      }
    ]
  },
  {
    "date": "10/15/25",
    "entries": [
      {
        "title": "🔋 Battery Ownership",
        "content": "The value of an EV is the battery which is best realized as consumable amperage. As long as utilities and car companies have the moat on determinative electrons, EV cost per mile coupled with other ownership frictions ain’t consumable at this high price. It’s not even worth a Prius-pious conscience. Give me Waymo and legacy ICE at home with a full tank, hard steel, and a low premium ready to go fast and uninhibited. Fuck your subprime financing, the conformist design with digital dashboard slop. Fuck your market interventions, your ‘sector restructuring’ mandates, the CO2 activists with their abysmal emissions reductions. The price is wrong, bitches. Give me solid state. Give me control of my Battery Energy Storage System (BESS) so I can charge it with the sun. Otherwise I’m wrangling with Harrison Ford and my unadaptive American flag!"
      }
    ]
  },
  {
    "date": "9/25/25",
    "entries": [
      {
        "title": "🔒 Authoritarianism > Vagrants",
        "content": "Authoritarianism over vagrants anyday of the week. Lock them up. So sick of it. Since troops in D.C., homicides 23 to 8. Robberies down 54%, burglaries down 48%. Democrats indirectly embrace criminality as they speak softly AND carry no sticks."
      }
    ]
  },
  {
    "date": "9/19/25",
    "entries": [
      {
        "title": "📡 FCC's Byzantine Bureaucracy",
        "content": "We're about to find out that the FCC operates in byzantine style much like the BLS. The public interest clause will soon be exposed as absurd and anachronistic."
      }
    ]},
  {
    "date": "9/17/25",
    "entries": [
      {
        "title": "🥩 Battle of the Institutes",
        "content": "The Meat Institute says the meat is safe. The Anti-Meat Institute says it is not. The Institute of Medicine says the Medicine is safe. The Institute of Anti-Medicine says it is not. The Institute of International Peace says the war is not safe. The Institute of War says it is."
      },
      {
        "title": "🙈 Define Terrorism",
        "content": "'When there is talk of hatred, let us stand up and talk against it. When there is talk of violence, let us stand up and talk against it.' - President Clinton<br><br>•'Famously difficult to define.' - Judge Gregory Carro<br>• Violently broadcasting a social and political message<br>• The calculated use of violence or the threat of violence to inculcate fear<br>• Intended to coerce or intimidate governments or societies<br>• Often motivated by political, religious, or ideological objectives<br>• Typically targets civilians or non-combatants<br>• Aims to create fear for political purposes<br>• The use of violence and intimidation in the pursuit of political aims<br>• An act of violence or threat that is intended to create fear in a population"
      },
      {
        "title": "💊 America The Fat",
        "content": "Does no one see the irony of a Zepbound ad followed by a fast food ad while passively watching pro sports on TV?"
      },
      {"title": "☎️ bling, bling, 'this is the BLS'",
      "content": "'Do you have time to answer some questions we have about your job status?'<br>The BLS thinks we should use telephones to call people who have smartphones with iOS 26."}
      ]},
  {
  "date": "8/24/25",
  "entries": [
     {
      "title": " 🐇 rabbit hole",
      "content": "The algorithm sends you down the rabbit hole to keep you engaged. When you get out, you realize it's nice and sunny above ground."
    },
    {
      "title": "🛌 Sleep",
      "content": "If I'm not getting sleep, it's because my circadian rhythm and BRAC (Basic Rest-Activity Cycle) are out of sync or I have something unresolved in my mind. It's not because of my mattress. Adhering to cycles and physical exhaustion from having woken up early, help my body know when to sleep and when to wake up. The solution for me so far? Waking up early and exercising to maintain a consistent sleep cycle. I refuse to spend $5,000 on a smart mattress pad."
    }
  ]
}, {
  "date": "8/23/25",
  "entries": [
    {
      "title": "🏠 The Priciest Home in America",
      "content": "$300M estate in Aspen, CO. 74 acres, 27,426 sq ft, 18 beds, 24 baths, and a private lake. <a href='https://www.zillow.com/homedetails/161-Stillwater-Dr-Aspen-CO-81611/14001053_zpid/' target='_blank'>Check it out</a>"
    }
  ]
},  {
  "date": "8/22/25",
  "entries": [
    {
      "title": "🏥 The Hidden Costs of Healthcare",
      "content": "Our healthcare system is broken, with insurance creating perverse incentives that inflate costs. A simple blood test panel costs $255 privately but $964 through insurance. The system discourages price shopping as patients only see minimal copays, while doctors are incentivized to order unnecessary tests. Even 'preventive care' often feels like a data collection scheme, with insurance companies offering small rewards for personal health data. The solution? More transparency and questioning whether each test or prescription is truly necessary. <a href='/news.html?article=healthcare-costs'>Read more</a>"
    },
    {
      "title": "⚖️ James V. Trump",
      "content": "'A fine cannot be proportionate to the offense unless it is reasonably calculated to encompass only the actual proceeds that defendants realized from their fraud.' - Justice Moulton <a href='https://nycourts.gov/courts/AD1/calendar/AppsMots/2025/apps/20250821/2023-04925,%20et%20ano..pdf'>James v. Trump</a>"
    }]
},
{
    "date": "8/20/25",
    "entries": [
      {
        "title": "💉 AAP v. RFK Jr.",
        "content": "Ignore the AAP. Their president (She/Her) founded a task force for equitable interoperability...In other words, she's full of shit. No COVID-19 shots for 6 months to 23 months (not to say that mRNA tech is not effective)."
      },
      {
        "title": "⚠️ The War on Terror",
        "content": "The threat to your freedom was not a man in an Afghanistan cave. The threat to your freedom is your local, state, and federal government during an emergency."
      },
      {
        "title": "🏆 Peace is for Losers",
        "content": "The press unanimously denounced Trump as the loser in the Alaska peace summit. Now he has urged Putin to meet with Zelensky. Is he still the loser?"
      }
    ]
  },
  {
  "date": "8/11/25",
  "entries": [
       {
        "title": "🗣️ Speak Impeccably",
        "content": "Brevity prompts." 
      },
      {
        "title": "👥 Obsolescent Corpulence",
        "content": "Sat next to a corpulent person on the plane. Went through stages of denial, anger, bargaining, sadness, and acceptance. Empathy (I'm in her shoes now). To lose fat, I need to regulate my blood sugar and appetite, reduce amyloid plaque and tangles of tau proteins, eat less (qualify that for me: what is processed? how much fiber? less carbs? more protein? intermittent fasting?), exercise more (10k steps is BS now? inclines? weights? frequently?) This is difficult. Live and think like a hunter gatherer? Okay, but I'm depressed, broke, and despondent. Take glucagon-like peptides (GLP-1)? Now we're talking 💰. Ask a doctor and the capital markets how they can make money off my fat ass. No exploitable free cash flow in a healthy neanderthal." 
      },
      {
        "title": "💄 Make Something Old New (Again)",
        "content": "Even autocomplete appends with 'Again'! To make cars beautiful (again), to make America healthy (again), to make America great (again); it's all so tiresome. Revisionary is now visionary."
      }
    ]
  },
  {
  "date": "8/7/25",
  "entries": [
    {
      "title": "🍎 shaking the apple tree",
      "content": "this president understands pressure points."
    }
  ]
},
   {
    "date": "8/2/25",
    "entries": [
      {
        "title": "💊 polypharmic profligacy",
        "content": "how bout rescinding VA funding for the combat cocktails?"}
    ]
  },
  {
  "date": "7/24/25",
  "entries": [
    {
      "title": "🚗 No Drivah",
      "content": "I don't give 2 💩💩 about politics when it comes to transportation. $TSLA Q2 384,122 vehicles down from last year's 443,956 - don't care. Protest all you want. Autonomous A to B is a human miracle and the market will reward it if successful."
    },
    {
      "title": "🏥 Sole Source Bedding",
      "content": "If you are ordained by the state, you can earn $500,000 for a bed and $90,000/year to maintain a person in said bed."
    }
  ]
  },
  {
  "date": "7/21/25",
  "entries": [
    {
      "title": "⛏️ Political Undermining",
      "content": "DNI undermines NYT. NYT undermines DNI. Trump subverts Obama. Obama subverts Trump. Right. Left. Ping. Pong. Ding. Bang. Oww."
    }, {
      "title": "🧐 Prognostication  Masturbation",
      "content": "If you're surprised again and again by consumers, you're not listening and should not be an economist/prognosticator."
    },
    {
      "title": "🧑‍💻 Entrenched Employment",
      "content": "<a href=\"https://youtu.be/y2Dg7FoDdEk?si=HNb6bqSGPFdUUII1\">Too many people doing stupid shit for a paycheck</a>. Remove entrenched employment, allow the market to determine the value of labor, supplant unions with commonwealth protections, remove regulatory barriers, and deploy AI to identify and address market distortions."
    }
    ]},
  {
  "date": "7/13/25",
  "entries": [
    {
      "title": "🗞️ NYT TDS",
      "content": "'It seems as if he is trying to repeal much of the 20th century.'"
    }
    ]},
    {
  "date": "7/10/25",
  "entries": [
    {
      "title": "👟 Dick Reid",
      "content": "<b>Bio:</b> 51 year old Brit now in ADX Florence Supermax. Dad stole cars. In and out of detention since 16 for petty crime and gang graffiti under tag name 'Enrol' in London. Converted to Islam in prison before deciding to wear these shoes on AA63 from Paris to Miami on 12/22/2001. Subdued by heroes.<img src=\"https://en.wikipedia.org/wiki/Special:FilePath/Richard_Reid's_Shoes.jpg\" alt=\"Richard Reid's Shoes\" style=\"max-width:200px;display:block;margin:10px 0;\">"
    }
    ]},
  {
  "date": "7/6/25",
  "entries": [
    {
      "title": "⛰️",
      "content": "sitting on top of a mountain editing JSON."
    }]},
  {
  "date": "7/4/25",
  "entries": [
    {
      "title": " Happy Fourth of July!",
      "content": "<a href=\"https://www.archives.gov/founding-docs/declaration-transcript\">Consent of the Governed</a>"
    }
    ]
    },
  {
  "date": "7/1/25",
  "entries": [
    {
      "title": "⌛️ Time Suck",
      "content": "so much junk to sift through on socials. new info pipeline needed."
    }
    ]
    },
  {
  "date": "6/19/25",
  "entries": [
    {
      "title": "🫏 NYT's Donor State Contradiction",
      "content": "NYT is flawed, arbitrary, and counterintuitive to claim that the Donor State concept is 'flawed, arbitary, and counterintuitive' but then share a prominent table showing Blue States as Donor states. Ascribe to the concept or don't. But ya did."
    },
    {
      "title": "🤠 Introducing unverified <a href=\"https://x.com/docriter\">@DocRiter</a>",
      "content": "There's this guy here at HS who is full of commentary and we try to shut him up so we've moved him from the Welcome page to an Opinion section just for him. Now to the back fold of the Journal section within the Read Section. Keep your mouth shut, young man!"
    },
    {
      "title": "🏚️ Rent Control Market Distortions",
      "content": "NYT states that 1M rent-controlled landlords net operating income was up 12.1% and that they're, 'actually doing pretty well.' Big thing missing. Just a major fact. Missing. Landlords costs are down because they're not investing in their properties. They aren't spending or are disclosing the smallest costs to justify whatever increases they can get under state control. State intervention will always have adverse market incentives. Remove the state and a Fair Market Rent and a Free Market system will fascilitate price discovery. Landlords will invest and tenants will get better deals. More compliance costs, more state intervention, and you get HIGHER PRICES."
    }
  ]
  },
  {
  "date": "6/17/25",
  "entries": [
    {
      "title": "🤑 Money vs Independence",
      "content": "Accept money or retain independence?"
    }
  ]
  },
  {
  "date": "5/13/25",
  "entries": [
    {
      "title": "💾 Github as Social Platform",
      "content": "tweeting on Github feels like how it should be. creators hanging with other creators. agency. no sycophants."
    }
  ]
  },
  {
  "date": "5/12/25",
  "entries": [
    {
      "title": "🚙 Defender Dreams",
      "content": "I want a Defender so I can drive on top of dunes and up streams to waterfalls and up steps to Tudor homes."
    }
  ]
  },
  {
  "date": "5/9/25",
  "entries": [
    {
      "title": "🌆 Nob Hill",
      "content": "Asian Man Black shoes<br>Rolls Royce Dusty top<br>Long shadows on a Friday night bench<br>An Acura parked long term. A tucked ticket.<br>Clipping heals to date night.<br>Gas engines purring from stop signs.<br>Wandering elderly man in sneakers, jeans, and a sweatshirt.<br>A crew, 'for me to be happy in the city…'<br>Sitting still is not easy.<br>The world passes you by and it's completely indifferent.<br>The sun feels nice and the cable cars creak; comfort in cacophony and cacophony in comfort.<br>A weird word. A weird world."
    }
  ]
  }
]
