[{
    "date": "6/5/25",
    "content": "maybe it's time for alternative methods to estimate CPI. AI > human enumerators." },
  
  {
    "date": "6/4/25",
    "content": "Circle IPO tomorrow. S-1 Sum <a href=\"Circle IPO.html\"><b>here</b></a>" },
  {
    "date": "6/3/25",
    "content": "Need to relook at $USAAX, $LSGRX, $NWZMX, $FBCGX, $STCIX, $BDAIX. You know what they had in 2023? $NVDA. That's what. Loomis Sayles bought Nvidia on a price dip in 2019!" },
  {
    "date": "5/31/25",
    "content": "Waymo: safety then cost. Tesla: cost then safety." },
  {
    "date": "5/29/25",
    "content": "what job is not noble and does AI care?" },
  {
    "date": "5/29/25",
    "content": "Does this only apply to certain taxes or just ones imposed by Trump that aren't actually taxes? 'The president cannot ignore the Constitution and impose massive tax hikes on the American people.' - New York Attorney General. As long as EMERGENCY UNUSUAL EXTRAORDINARY remain ambiguous terms, the unitary executive will bite."
  },  
    {
    "date": "5/28/25",
    "content": "Summary of FOMC May Meeting minutes in <a href=\"read.html\"><b>read</b></a> section."
  }, 
  {
    "date": "5/25/25",
    "content": "Rotten Tomatoes and IMDb ratings added to <a href=\"watch.html\"><b>watch</b></a> section."
  },
  {
    "date": "5/24/25",
    "content": "Allen Stone 🎤"
  },
  {
    "date": "5/22/25",
    "content": "getting more disciplined. If I'm on X, YouTube, etc. and don't find anything that benefits me, EXIT. Algo wants engagement."
  },
  {
    "date": "5/22/25",
    "content": "Anyone surfing the Web?"
  },
  {
    "date": "5/22/25",
    "content": "I want to tell a story here, but not sure if anyone is listening. I would post a chapter at a time in the <a href=\"read.html\"><b>read</b></a> section where you can now find the latest Supreme Court case analysis."
  },
  {
    "date": "5/20/25",
    "content": "the algorithm selects, organizes, and presents using algorithms."
  },
  {
    "date": "5/19/25",
    "content": "the algorithm doesn't serve me well; it serves the company. I'm in need of content that benefits me, so I'm learning to code."
  },
  {
    "date": "5/18/25",
    "content": "remember the outrage over describing Biden as, 'an elderly man with a poor memory?'"
  },
  {
    "date": "5/17/25",
    "content": "how many times do you catch yourself having squandered time on social media?"
  },
  {
    "date": "5/15/25",
    "content": "Watch Holy Spider in <a href=\"watch.html\"><b>watch</b></a> Section with Kanopy.<br>About: Female journalist Rahimi (Zar Amir Ebrahimi) travels to the Iranian holy city of Mashhad to investigate a serial killer who believes he is doing the work of God, cleansing the streets of sinners by murdering sex workers. As the body count mounts, and Rahimi draws closer to exposing his crimes, the opportunity for justice grows harder to attain as the 'Spider Killer' is embraced by many as a hero. Based on the horrific true story of serial killer Saeed Hanaei, acclaimed writer/director Ali Abbasi (Border) unveils a gripping crime thriller, and a daring indictment of a society in which rough justice is routinely a fact of life."
  },
  {
    "date": "5/15/25",
    "content": "meanwhile Klobuchar (who looks like she just woke up or is between cosmos) and Laurence are getting to the bottom of the airplane gift scandal."
  },
  {
    "date": "5/15/25",
    "content": "seems like every time I tune to BBC, they're talking about chimps again."
  },
  {
    "date": "5/14/25",
    "content": "the clothed contempt of the tired New Yorker regarding the Post as 'naked malice' is the old guard telling young Hamilton to bite his tongue."
  },
  {
    "date": "5/14/25",
    "content": "It's now acceptable to affirm developed-nation sovereignty; UK PM 'I've already returned over 24,000 people with no right to be here.'"
  },
  {
    "date": "5/13/25",
    "content": "tweeting on Github feels like how it should be. creators hanging with other creators. agency. no sycophants."
  },
  {
    "date": "5/12/25",
    "content": "tweeting to myself. that'll show them!"
  },
  {
    "date": "5/12/25",
    "content": "I want a Defender so I can drive on top of dunes and up streams to waterfalls and up steps to Tudor homes."
  },
  {
    "date": "5/11/25",
    "content": "In the book 'Positive Intelligence' we are taught to embrace our Sage over our Judge. The Five Sage Powers are Empathy, Exploration, Innovation, Navigation, and Activation.<br>As a preemptive Judge (Hyper Vigilant Saboteur), I of course was pissed at the junkie in the Mother's Day card section who was rummaging through the cards and not moving. Another card shopper with earpods in, took the situation calmly as if he didn't notice how angry I was. I later reported the junkie to security and left without a Mother's Day card.<br>Through Empathy, I thought maybe the junkie was rummaging through Mother's Day cards because he missed his mom. This man was once a young boy embraced by a loving mother.<br>Through Exploration, I became curious (Fascinated Anthropologist). How does a happy boy become an addict? How many instances of grief and disappointment had this man gone through?<br>Through Innovation, I thought maybe I could share this story because I still struggle with accepting the many mentally unstable individuals constantly disrupting our lives in San Francisco.<br>Through Navigation, I realize no one wants to deal with them. They say they do, but the idealist judges and doesn't act. They are saboteurs, not sages.<br>Through Activation, I channel Candy Lightner who lost her 13-year old daughter to a drunk driver and started MADD. The mentally ill need to be removed from the streets against their free will if they are breaking the law. The rule of law must apply to them because it's not fair to everyone else."
  },
  {
    "date": "5/9/25",
    "content": "Nob Hill<br>Asian Man Black shoes<br>Rolls Royce Dusty top<br>Long shadows on a Friday night bench<br>A laundromat (closed for repair) with empty windows<br>An Acura parked long term. A tucked ticket.<br>Clipping heals to date night.<br>Gas engines purring from stop signs.<br>Wandering elderly man in sneakers, jeans, and a sweatshirt.<br>A crew, 'for me to be happy in the city…'<br>Sitting still is not easy.<br>The world passes you by and it's completely indifferent.<br>The sun feels nice and the cable cars creak; comfort in cacophony and cacophony in comfort.<br>A weird word. A weird world."
  }
]
